Repository: dklemmt/contao_dk_mmenu
Catalog: src/Resources/contao/languages/*/*_module.xlf
Languages: de

# tl_module.mmenu_appearance_legend
source: mmenu appearance
de: mmenu-Aussehen

# tl_module.mmenu_behaviour_legend
source: mmenu behaviour
de: mmenu-Verhalten

# tl_module.mmenu_effects_legend
source: mmenu effects
de: mmenu-Effekte

# tl_module.mmenu_legend
source: mmenu settings
de: mmenu-Einstellungen

# tl_module.mmenu_keyboard_navigation_legend
source: mmenu keyboard navigation
de: mmenu-Navigation mit Tastatur

# tl_module.dk_mmenuPosition.0
source: Position of menu
de: Position des Menüs

# tl_module.dk_mmenuPosition.1
source: Choose the position of the menu.
de: Bestimmt auf welcher Seite das Menü erscheinen soll.

# tl_module.dk_mmenuZposition.0
source: Z-position of menu
de: Z-Position des Menüs

# tl_module.dk_mmenuZposition.1
source: Choose the z-position of the menu.
de: Hier können sie die z-Position bestimmen.

# tl_module.dk_mmenuSlidingSubmenus.0
source: Kind of menu
de: Art des Menüs

# tl_module.dk_mmenuSlidingSubmenus.1
source: Determines whether submenus should come sliding in from the right or to expand below.
de: Bestimmt, ob Untermenüs von rechts hineingleiten oder nach unten aufklappen.

# tl_module.dk_mmenuTheme.0
source: Theme of menu
de: Theme des Menüs

# tl_module.dk_mmenuTheme.1
source: Choose a theme for the menu.
de: Hier können Sie das mmenu-Theme auswählen mit dem die Navigation angezeigt wird.

# tl_module.dk_mmenuMoveBackground.0
source: Move background
de: Hintergrund verschieben

# tl_module.dk_mmenuMoveBackground.1
source: Determines whether or not the page should inherit the background of the body when the menu opens.
de: Bestimmt, ob der Hintergrund von body an das Menü vererbt wird wenn dieses öffnet oder mit der Seite verschoben wird.

# tl_module.dk_mmenuFullscreen.0
source: Fullscreen
de: Vollansicht

# tl_module.dk_mmenuFullscreen.1
source: Determines whether the menu will fill up 80% (default) of the available width/height or 100% (fullscreen).
de: Bestimmt, ob das Menü 80% (Standard) der zur Verfügung stehenden Breite/Höhe einnehmen soll oder 100% (komplette Seite).

# tl_module.dk_mmenuCountersAdd.0
source: Show submenu counter
de: Zähler für Untermenüs

# tl_module.dk_mmenuCountersAdd.1
source: Determines whether or not to append a counter to each menu item if it has a submenu and automatically counting the number of items inside.
de: Bestimmt, ob ein Menü um einen Zähler erweitert wird falls es Untermenüs enthält. Die Zahl zeigt die Anzahl dieser an.

# tl_module.dk_mmenuColumnsAdd.0
source: Show submenu columns
de: Spalten für Untermenüs

# tl_module.dk_mmenuColumnsAdd.1
source: Determines whether the panels should be split up into multiple columns.
de: Bestimmt, ob ein die Untermenüs in mehreren Spalten dargestellt werden soll.

# tl_module.dk_mmenuSearchfieldAdd.0
source: Show searchfield
de: Suchfeld anzeigen

# tl_module.dk_mmenuSearchfieldAdd.1
source: Determines whether or not to automatically prepend a searchfield to the menu.
de: Bestimmt, ob ein Suchfeld oberhalb der Navigation angezeigt wird.

# tl_module.dk_mmenuDragOpenEnable.0
source: Drag page to open menu
de: Menü durch Ziehen der Seite öffnen

# tl_module.dk_mmenuDragOpenEnable.1
source: Determines whether or not the menu should open when dragging the page.
de: Bestimmt, ob das Menü auch durch Ziehen der Seite geöffnet werden kann.

# tl_module.dk_mmenuDragOpenThreshold.0
source: Amount of pixels to drag
de: Anzahl von gezogenen Pixeln

# tl_module.dk_mmenuDragOpenThreshold.1
source: Determines the minimum amount of pixels to drag before actually opening the menu, less than 50 is not advised.
de: Bestimmt die minimale Anzahl von Pixeln, die die Seite gezogen werden muß bis sich das Menü öffnet. Weniger als 50 Pixel werden nicht empfohlen.

# tl_module.dk_mmenuPolyfillEnable.0
source: Add JavaScript Polyfill
de: JavaScript Polyfill hinzufügen

# tl_module.dk_mmenuPolyfillEnable.1
source: Determines whether or not the IE10 and IE11 JavaScript Polyfill should be available.
de: Bestimmt, ob das JavaScript Polyfill für IE10 und IE11 zur Verfügung gestellt wird.

# tl_module.dk_mmenuOnClickClose.0
source: Menu closes after click
de: Menü nach Klick schließen

# tl_module.dk_mmenuOnClickClose.1
source: Determines whether or not the menu should close after clicking a link inside it.
de: Bestimmt, ob nach Auswahl eines Navigationspunkts das Navigationsmenü geschlossen wird.

# tl_module.dk_mmenuFixedElementAdd.0
source: Support fixed and sticky elements
de: Unterstützung für fixed und sticky Elemente

# tl_module.dk_mmenuFixedElementAdd.1
source: Adds support elements with position: fixed and position: sticky, so they don't disappear when opening the menu.
de: Fügt die Unterstützung für Elemente mit position: fixed und position:sticky hinzu, so dass diese nicht verschwinden, wenn das Menü geöffnet wird.

# tl_module.dk_mmenuJsTpl.1
source: Choose the JavaScript template.
de: Hier können Sie das JavaScript-Template auswählen.

# tl_module.dk_mmenuPosition.left
source: left
de: links

# tl_module.dk_mmenuPosition.right
source: right
de: rechts

# tl_module.dk_mmenuPosition.top
source: top
de: oben

# tl_module.dk_mmenuPosition.bottom
source: bottom
de: unten

# tl_module.dk_mmenuZposition.back
source: back
de: dahinter

# tl_module.dk_mmenuZposition.front
source: front
de: davor

# tl_module.dk_mmenuSlidingSubmenus.vertical
source: vertical
de: vertikal

# tl_module.dk_mmenuPageSelector.1
source: Custom defined page wrapper CSS selector (e.g. "#wrapper").
de: Selbst definierter "page wrapper" CSS-Selector (z.B.: "#wrapper").

# tl_module.dk_mmenuPageDim.0
source: Page dim
de: Abdimmen

# tl_module.dk_mmenuPageDim.1
source: Page dim
de: Abdimmen der Seite, wenn das Menü offen ist.

# tl_module.dk_mmenuPageDimOptions.white
source: white
de: Weiß

# tl_module.dk_mmenuPageDimOptions.black
source: black
de: Schwarz

# tl_module.dk_mmenuMenuEffects.0
source: Menu effects
de: Menü Effekte

# tl_module.dk_mmenuMenuEffects.1
source: Available effects for the menu.
de: Verfügbare Effekte für das Menü.

# tl_module.dk_mmenuPanelEffects.0
source: Panel effects
de: Panel Effekte

# tl_module.dk_mmenuPanelEffects.1
source: Available effects for the panels.
de: Verfügbare Effekte für die Panele.

# tl_module.dk_mmenuListEffects.0
source: List items effects
de: Effekte für Listeneinträge

# tl_module.dk_mmenuListEffects.1
source: Available effects for the list items.
de: Verfügbare Effekte für die Listeneinträge.

# tl_module.dk_mmenuIconPanels.0
source: Show small part of parent panel
de: Zeige einen kleinen Teil übergeordneter Panele

# tl_module.dk_mmenuIconPanels.1
source: When enabled, this will show a small part of the parent panel, when opening a sub-panel.
de: Zeigt einen kleinen Teil der übergenordneten Panele an, wenn man sich in einem Unterpanel befindet.

# tl_module.dk_mmenuShadows.0
source: Shadows
de: Schatten

# tl_module.dk_mmenuShadows.1
source: You can choose which elements get a shadow.
de: Fügt einen Schatten zu den ausgewählten Elementen hinzu.

# tl_module.dk_mmenuShadowsOptions.menu
source: Menu
de: Menü

# tl_module.dk_mmenuShadowsOptions.page
source: Page
de: Seite

# tl_module.dk_mmenuShadowsOptions.panels
source: Panels
de: Panele

# tl_module.dk_mmenuKeyboardNavigation.0
source: Keyboard navigation
de: Navigation mit Tastatur

# tl_module.dk_mmenuKeyboardNavigation.1
source: Enable navigating the menu with keyboard.
de: Aktivieren Sie die Navigation im Menü mit der Tastatur.

# tl_module.dk_mmenuKeyboardNavigationEnhance.0
source: Enhance keyboard navigation
de: Verbesserte Tastaturnavigation

# tl_module.dk_mmenuKeyboardNavigationEnhance.1
source: Enhance basic default keyboard navigation.
de: Verbessern Sie die grundlegende Standard-Tastaturnavigation.
