Repository: dklemmt/contao_dk_mmenu
Catalog: system/modules/dk_mmenu/languages/*/*_module.xlf
Languages: fr

# tl_module.mmenu_appearance_legend
source: mmenu appearance
fr: Apparence de mmenu

# tl_module.mmenu_behaviour_legend
source: mmenu behaviour
fr: Comportement de mmenu

# tl_module.mmenu_effects_legend
source: mmenu effects
fr: Effets de mmenu

# tl_module.mmenu_legend
source: mmenu settings
fr: Paramètres de mmenu

# tl_module.dk_mmenuPosition.0
source: Position of menu
fr: Position du menu

# tl_module.dk_mmenuPosition.1
source: Choose the position of the menu.
fr: Choisir la position du menu.

# tl_module.dk_mmenuZposition.0
source: Z-position of menu
fr: Z-position du menu

# tl_module.dk_mmenuZposition.1
source: Choose the z-position of the menu.
fr: Choisir la z-position du menu.

# tl_module.dk_mmenuSlidingSubmenus.0
source: Kind of menu
fr: Type de menu

# tl_module.dk_mmenuSlidingSubmenus.1
source: Determines whether submenus should come sliding in from the right or to expand below.
fr: Détermine si oui ou non les sous-menus doivent apparaître sur le côté droit ou vers le bas.

# tl_module.dk_mmenuTheme.0
source: Theme of menu
fr: Thème du menu

# tl_module.dk_mmenuTheme.1
source: Choose a theme for the menu.
fr: Choisir un thème pour le menu.

# tl_module.dk_mmenuMoveBackground.0
source: Move background
fr: Déplacement du fond

# tl_module.dk_mmenuMoveBackground.1
source: Determines whether or not the page should inherit the background of the body when the menu opens.
fr: Détermine si oui ou non la page doit hériter du fond du body lorsque le menu s'ouvre.

# tl_module.dk_mmenuFullscreen.0
source: Fullscreen
fr: Plein écran

# tl_module.dk_mmenuFullscreen.1
source: Determines whether the menu will fill up 80% (default) of the available width/height or 100% (fullscreen).
fr: Détermine si oui ou non le menu va se remplir de 80% (par défaut) de la largeur et de la hauteur disponible ou 100% (plein écran).

# tl_module.dk_mmenuCountersAdd.0
source: Show submenu counter
fr: Afficher le nombre de sous-menus

# tl_module.dk_mmenuCountersAdd.1
source: Determines whether or not to append a counter to each menu item if it has a submenu and automatically counting the number of items inside.
fr: Détermine si oui ou non un compteur est ajouté pour chaque élément de menu s'il possède un sous-menu et compter automatiquement le nombre d'éléments à l'intérieur.

# tl_module.dk_mmenuCountersUpdate.0
source: Update submenu counter
fr: Mettre à jour le compteur du sous-menu

# tl_module.dk_mmenuCountersUpdate.1
source: Determines whether or not to automatically count the number of items in the submenu, updates when typing in the search field.
fr: Détermine si oui ou non le comptage automatique du nombre d'éléments dans le sous-menu, mis à jour lors de la saisie dans le champ de recherche.

# tl_module.dk_mmenuSearchfieldAdd.0
source: Show searchfield
fr: Afficher le champ de recherche

# tl_module.dk_mmenuSearchfieldAdd.1
source: Determines whether or not to automatically prepend a searchfield to the menu.
fr: Détermine si oui ou non un champ de recherche est placé automatiquement dans le menu.

# tl_module.dk_mmenuEffectSlide.0
source: Slide in
fr: Glisser vers l’intérieur

# tl_module.dk_mmenuEffectSlide.1
source: Makes the menu slide in from the side.
fr: Fait glisser le menu à partir du côté.

# tl_module.dk_mmenuEffectZoomMenu.0
source: Zoom menu
fr: Menu zoom

# tl_module.dk_mmenuEffectZoomMenu.1
source: Makes the menu zoom in.
fr: Donne un effet d'agrandissement au menu.

# tl_module.dk_mmenuEffectZoomPage.0
source: Zoom page
fr: Page zoom

# tl_module.dk_mmenuEffectZoomPage.1
source: Makes the page zoom in while opening the menu, works great in combination with the mm-zoom-menu effect.
fr: Donne à la page un effet d'agrandissement tout en ouvrant le menu, fonctionne très bien en combinaison avec l'effet "Menu zoom".

# tl_module.dk_mmenuEffectZoomPanels.0
source: Zoom panels
fr: Panneaux zoom

# tl_module.dk_mmenuEffectZoomPanels.1
source: Makes the panels zoom out while opening a submenu.
fr: Donne aux panneaux un effet de rapetissement lors de l'ouverture d'un sous-menu.

# tl_module.dk_mmenuDragOpenOpen.0
source: Drag page to open menu
fr: Faire glisser la page pour ouvrir le menu

# tl_module.dk_mmenuDragOpenOpen.1
source: Determines whether or not the menu should open when dragging the page.
fr: Détermine si oui ou non le menu doit s'ouvrir lorsque vous faites glisser la page.

# tl_module.dk_mmenuDragOpenThreshold.0
source: Amount of pixels to drag
fr: Quantité de pixels pour faire glisser

# tl_module.dk_mmenuDragOpenThreshold.1
source: Determines the minimum amount of pixels to drag before actually opening the menu, less than 50 is not advised.
fr: Détermine la quantité minimale de pixels pour faire glisser avant d'ouvrir réellement le menu, moins de 50 n'est pas conseillé.

# tl_module.dk_mmenuOnClickClose.0
source: Menu closes after click
fr: Le menu se ferme après un clic

# tl_module.dk_mmenuOnClickClose.1
source: Determines whether or not the menu should close after clicking a link inside it.
fr: Détermine si oui ou non le menu doit fermer après avoir cliqué sur un lien à l'intérieur.

# tl_module.dk_mmenuOnClickBlockUI.0
source: Block user interface
fr: Bloquer l'interface utilisateur

# tl_module.dk_mmenuOnClickBlockUI.1
source: Determines whether or not to block the user interface while loading the new page.
fr: Détermine si oui ou non l'interface utilisateur est bloqué lors du chargement de la nouvelle page.

# tl_module.dk_mmenuModal.0
source: modal menu
fr: menu modal

# tl_module.dk_mmenuModal.1
source: Determines whether or not the menu should be modal. A close button has to be provided.
fr: Détermine si oui ou non le menu doit être modal. Un bouton de fermeture doit être fournie.

# tl_module.dk_mmenuArticle.1
source: Choose the article.
fr: Choisir l'article.

# tl_module.dk_mmenuHtmlTpl.0
source: HTML template
fr: Modèle HTML

# tl_module.dk_mmenuHtmlTpl.1
source: Choose the HTML template.
fr: Choisir le modèle HTML.

# tl_module.dk_mmenuJsTpl.0
source: JavaScript template
fr: Modèle JavaScript

# tl_module.dk_mmenuJsTpl.1
source: Choose the JavaScript template.
fr: Choisir le modèle JavaScript.

# tl_module.dk_mmenuPosition.left
source: left
fr: gauche

# tl_module.dk_mmenuPosition.right
source: right
fr: droite

# tl_module.dk_mmenuPosition.top
source: top
fr: en haut

# tl_module.dk_mmenuPosition.bottom
source: bottom
fr: en bas

# tl_module.dk_mmenuZposition.back
source: back
fr: en arrière

# tl_module.dk_mmenuZposition.front
source: front
fr: en avant

# tl_module.dk_mmenuZposition.next
source: next
fr: en suivant

# tl_module.dk_mmenuTheme.black
source: black
fr: noir

# tl_module.dk_mmenuTheme.standard
source: dark
fr: foncé

# tl_module.dk_mmenuTheme.light
source: medium grey (light)
fr: gris moyen (léger)

# tl_module.dk_mmenuTheme.lighter
source: light grey (light)
fr: gris clair (léger)

# tl_module.dk_mmenuTheme.lightest
source: light
fr: clair

# tl_module.dk_mmenuTheme.white
source: white
fr: blanc

# tl_module.dk_mmenuTheme.army
source: army (dark)
fr: army (foncé)

# tl_module.dk_mmenuTheme.bordeaux
source: bordeaux (dark)
fr: bordeaux (foncé)

# tl_module.dk_mmenuTheme.navy
source: navy (dark)
fr: navy (foncé)
